# Brewfile — macOS-only taps and casks
# CLI tools shared with Linux are in Brewfile.common

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"

# ── macOS-only casks ──

# AI Clients
cask "claude"

# Agentic interfaces
cask "conductor"

# Browsers
cask "arc"
cask "firefox"
cask "google-chrome"

# Comms
cask "discord"
cask "slack"
cask "whatsapp"

# Docker / Containerization
cask "orbstack"

# Fonts
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono"
cask "font-space-mono-nerd-font"

# IDE
cask "cursor"
cask "visual-studio-code"
cask "zed"

# Mail
cask "notion-mail"

# Media
cask "iina" # Video player
cask "shottr" # Screenshot tool

# Note taking
cask "obsidian"
cask "notion"

# Project management
cask "linear-linear"

# Security
cask "1password" # Password manager
cask "1password-cli" # 1Password CLI
cask "little-snitch" # Host-based application firewall
cask "micro-snitch" # Monitors and reports any microphone and camera activity

# Terminal emulators
cask "alacritty" # GPU-accelerated terminal emulator
cask "iterm2" # Reliable, fast and beautiful terminal emulator
cask "ghostty" # Fast, feature-rich, and cross-platform terminal emulator

# UI/UX
cask "figma"
cask "spline"

# Spotlight replacement
cask "raycast"

# Streaming / screencasting
cask "keycastr" # Show keystrokes on screen
cask "obs" # Video recording and streaming

# Utilities
cask "aerospace" # Tiling window manager
cask "avifquicklook" # Avif format quicklook extension
cask "appcleaner" # App uninstaller
cask "caffeine" # Prevents your Mac from automatically going to sleep - Helpful for builds
cask "keyboardcleantool" # Disable keyboard when cleaning the mac
cask "mediamate" # UI replacement for volume, brightness and now playing controls
cask "minisim" # Lightweight simulator launcher for iOS and Android
cask "spacelauncher" # App launcher/switcher
