tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"

# Language version manager
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern system monitoring CLI
brew "btop"
# Count lines of code in a project
brew "cloc"
# Commitizen CLI
brew "commitizen"
# Modern, maintained replacement for ls
brew "eza"
# Modern & fast system information tool
brew "fastfetch"
# Fast video transcoder
brew "ffmpeg"
# Fast and simple node version manager written in Rust
brew "fnm"
# Fast as fuck fuzzy finder
brew "fzf"
# GitHub CLI
brew "gh"
# Simple terminal UI for git commands
brew "lazygit"
# Node.js
brew "node"
# Fast, disk space efficient package manager
brew "pnpm"
# Modern replacement for `grep`
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt written in Rust
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# File watcher
brew "watchman"

# AI Clients
cask "claude"

# Browsers
cask "arc"
cask "firefox"
cask "google-chrome"

# Comms
cask "discord"
cask "slack"
cask "whatsapp"

# Docker / Containerization
cask "docker"
cask "orbstack"

# Fonts
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono"
cask "font-space-mono-nerd-font"

# IDE
brew "neovim"
cask "visual-studio-code"

# Media
cask "iina" # Video player
cask "shottr" # Screenshot tool

# Note taking
cask "obsidian"
cask "notion"

# Project management
cask "linear-linear"

# Security
cask "1password" # Password manager
cask "1password-cli" # 1Password CLI
cask "little-snitch" # Host-based application firewall
cask "micro-snitch" # Monitors and reports any microphone and camera activity

# Terminal emulators
cask "alacritty" # GPU-accelerated terminal emulator
cask "iterm2" # Reliable, fast and beautiful terminal emulator
cask "ghostty" # Fast, feature-rich, and cross-platform terminal emulator

# UI/UX
cask "figma"
cask "spline"

# Spotlight replacement
cask "raycast"

# Streaming / screencasting
cask "keycastr" # Show keystrokes on screen
cask "obs" # Video recording and streaming

# Utilities
cask "aerospace" # Tiling window manager
cask "appcleaner" # App uninstaller
cask "caffeine" # Prevents your Mac from automatically going to sleep - Helpful for builds
cask "keyboardcleantool" # Disable keyboard when cleaning the mac
cask "mediamate" # UI replacement for volume, brightness and now playing controls
cask "minisim" # Lightweight simulator launcher for iOS and Android
cask "spacelauncher" # App launcher/switcher

# Virtualization
cask "docker"
